/**
 *
 * Описание:
 *
 * Тази програма въвежда от клавиатурата цяло число n и извежда в триъгълна
 * форма числата от 1 до n (едно на първия ред, две на втория, и т.н., докато
 * не достигне до реда, в който се съдържа n). Останалите празни места във така
 * получената фигура се попълват със знака звезда (`*').
 *
 */

#include <iostream>
using namespace std;

int main()
{
    // въвеждаме числото n
    cout << "n="; int n; cin >> n;

    //
    // иниицализираме броячите, съхраняващи съответно:
    // текущото число, текущия ред и общия брой на редовете
    //
    int i = 1, k = 1, l = 1;

    //
    // изчисляваме броя на редовете (съответно и колоните) по формулата
    //   l * (l + 1) / 2 == n <=> l^2 + l - 2n = 0
    // В този случай l невинаги ще е естествено число, така че търсим
    // негово приближение отдолу за даденото n (тъй като n се намира на
    // реда (l - 1)). Затова увеличаваме l, докато лявата част на равенството
    // (горепосоченото) е по-малка от дясната (т.е. не я надминава).
    //
    while (n > l * (l + 1) / 2)
        l++;

    // докато не достигнем до извеждането на числото n
    while (i <= n)
    {
        // увеличавам
        for (int j = 1; j <= k; j++)
        {
            cout << i << " ";
            i++;
        }

        for (int j = k + 1; j <= l; j++)
        {
            cout << "* ";
        }

        cout << endl;
        k++;
    }

    return 0;
}
